Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_8_Constructional requirements _8 KONSTRUKTSIOONINÕUDED .tmx
Source language: en
Languages: et

source: 8 Constructional requirements
et: 8 KONSTRUKTSIOONINÕUDED

source: 8.1 Strength of materials and parts
et: 8.1 Materjalide ja osade tugevus

source: 8.1.1 General
et: 8.1.1 Üldnõuded

source: Under the responsibility of the original manufacturer, all design activities shall be carried out or supervised by a competent person.
et: Esmatootja vastutusalasse kuulub, et kõiki projekteerimistoiminguid peavad sooritama ja juhendama kompetentsed isikud.

source: The external shape of the assembly enclosure, if any, can vary to suit the application and use.
et: Kooste võimaliku ümbrise väliskuju võib olla mitmesugune, et rahuldada kooste rakendamist ja kasutamist.

source: Some examples are;
et: Mõned näited on

source: • cubicle-type assembly (see 3.3.4);
et: • kappkooste (vt termin 3.3.4),

source: • multi-cubicle-type assembly (see 3.3.5);
et: • mitmekapiline kooste (vt termin 3.3.5),

source: • desk-type assembly (see 3.3.6);
et: • pultkooste (vt termin 3.3.6),

source: • box-type assembly (see 3.3.7);
et: • kastkooste (vt termin 3.3.7),

source: • multi-box-type assembly (see 3.3.8);
et: • mitmekastiline kooste (vt termin 3.3.8),

source: • wall-mounted surface type assembly (see 3.3.9);
et: • seinakappkooste (vt termin 3.3.9),

source: • wall-mounted recessed type assembly (see 3.3.10); and
et: • süvistatav seinakappkooste (vt termin 3.3.10) ja

source: • floor-standing type assembly (3.3.11).
et: • põrandal seisev kooste (vt termin 3.3.11).

source: These enclosures may be constructed from various materials, e.g. insulating, metallic or a combination of these.
et: Need ümbrised võivad olla valmistatud mitmesugustest materjalidest, nt isoleerivatest, metallilistest või nendest kombineeritutest.

source: Assemblies shall be constructed of materials capable of withstanding the mechanical, electrical, thermal and environmental stresses that are likely to be encountered in specified service conditions.
et: Koosted peavad olema valmistatud materjalidest, mis taluvad sätestatud talitlusoludes ette tulevaid mehaanilisi, elektrilisi, soojuslikke ja keskkonnatoimeid.

source: In the case of special service conditions that can be present in the physical environment in which the assembly is to be installed (for example, dust, acids, corrosive gases, salts), the assemblies shall be adequately protected against contaminants (see Annex C).
et: Talitluse eriolude korral, mis võivad toimuda kooste paigaldamise füüsikalises keskkonnas (näiteks tolm, happed, korrodeerivad gaasid, soolad), peavad koosted olema saasteainete eest piisavalt kaitstud (vt lisa C).

source: When the assembly is subject to radiation (for example, X-rays, microwave, ultraviolet, lasers), additional measures shall be taken to avoid malfunctioning of the assembly and accelerated deterioration of the insulation.
et: Kui koostele toimib kiirgus (näiteks röntgenkiirgus, mikrolained, ultraviolettkiirgus, laserid), tuleb rakendada lisameetmeid kooste väärtalitluse ja isolatsiooni kiirendatud halvenemise vältimiseks.

source: When such measures are necessary, an agreement is required between the assembly manufacturer and the user.
et: Kui selliseid meetmeid on vaja, tuleb kooste tootja ja kasutaja vahel sõlmida sellekohane kokkulepe.

source: When the assembly is subject to undesirable effects of vibration or shock, e.g. caused by a machine and its associated equipment, the selection of suitable equipment, or mounting it away from the source of the vibration, or the provision of anti-vibration mountings shall be considered.
et: Kui koostele võivad toimida vältimatu vibratsioon või löögid, mis on nt tingitud masinatest ja nendega seotud seadmetest, tuleb kaaluda sobivamate seadmete valikut, paigaldamist vibratsiooniallikatest eemale või vibratsioonivastaste paigaldusviiside kasutamist.

source: 8.1.2 Protection against corrosion
et: 8.1.2 Kaitse korrosiooni eest

source: Protection against corrosion shall be ensured by the use of suitable materials or by protective coatings to the exposed surface, taking account of the normal service conditions (see 7.1).
et: Kaitse korrosiooni eest tuleb tagada kas sobivate materjalide või ohustatud pindade kaitsekatete kasutamisega, võttes arvesse normaaltalitlusolusid (vt jaotis 7.1).

source: Compliance with this requirement is checked by the test in 10.2.2.
et: Vastavust sellele nõudele tuleb kontrollida jaotises 10.2.2 kirjeldatud katsetusega.

source: 8.1.3 Properties of insulating materials
et: 8.1.3 Isoleermaterjalide omadused

source: 8.1.3.1 Thermal stability
et: 8.1.3.1 Kuumuskindlus

source: Enclosures or parts of enclosures made of insulating material(s), not already certified to their own product standard, e.g. louvers, meshes, shall be capable of operation at temperatures of at least 70 ⁰C.
et: Isoleermaterjali(de)st valmistatud ümbrised või ümbriseosad, mis mitte alati ei ole sertifitseeritud nende endi tootestandardite järgi, nt ventilatsiooniavad ja -võrgud, peavad vastu pidama talitlusele temperatuuril vähemalt 70 °C.

source: Thermal stability shall be verified according to 10.2.3.1.
et: Kuumuskindlust tuleb kontrollida vastavalt jaotisele 10.2.3.1.

source: 8.1.3.2 Resistance of insulating materials to heat and fire
et: 8.1.3.2 Isoleermaterjalide vastupidavus soojusele ja tulele

source: 8.1.3.2.1 General
et: 8.1.3.2.1 Üldnõue

source: Parts of insulating materials, which can be exposed to thermal stresses due to internal electrical effects, and the deterioration of which can impair the safety of the assembly, shall not be adversely affected by normal (operational) heat, and abnormal heat or fire.
et: Isoleermaterjalidest osad, mis võivad sattuda sisemistest elektrinähtustest tingitud soojuslike toimete alla ja mille riknemine võib vähendada kooste ohutust, ei tohi normaalse (talitlusliku) soojuse, anomaalse kuumuse ega tule toimel kahjustuda.

source: 8.1.3.2.2 Resistance of insulating materials to normal heat
et: 8.1.3.2.2 Isoleermaterjalide vastupidavus normaalsoojusele

source: The original manufacturer shall select insulating materials which are suitable for the maximum temperatures to which they are exposed in normal operation, in accordance with 9.2 and Table 6.
et: Esmatootja peab valima isoleermaterjalid, mis sobivad nendele normaaltalitlusel toimivale suurimale temperatuurile vastavalt jaotisele 9.2 ja tabelile 6.

source: The applied temperature-rise limit (see 9.2) for parts of insulating materials shall be justified based on, for example, the methods of IEC 60216 (all parts), or thermal class identified in accordance with IEC 60085:2007.
et: Isoleermaterjalist osade rakendatav ületemperatuuri piir (vt jaotis 9.2) tuleb põhjendada näiteks standardisarjas IEC 60216 esitatud meetodite alusel või temperatuuriklassiga, mis on identifitseeritud vastavalt standardile IEC 60085:2007.

source: NOTE With recognition of the differences to other methods, insulating materials can also be selected based on the relative thermal index (RTI), UL 746B.
et: MÄRKUS Muude meetodite erinevuste tunnustamisel võib isoleermaterjale valida ka suhtelise soojusliku indeksi (relative thermal index, RTI) alusel vastavalt standardile UL 746B.

source: 8.1.3.2.3 Resistance of insulating materials to abnormal heat and fire due to internal electric effects
et: 8.1.3.2.3 Isoleermaterjalide vastupidavus sisemistest elektrinähtustest tingitud anomaalsele kuumusele ja tulele

source: Insulating materials used for parts necessary to retain current carrying parts in position and parts which can be exposed to thermal stresses due to internal electrical effects, of which the deterioration can impair the safety of the assembly, shall not be adversely affected by abnormal heat and fire and shall be verified by the glow-wire test in 10.2.3.2.
et: Isoleermaterjalist osad, mis on vajalikud voolujuhtivate osade paigal hoidmiseks, ning osad, mis võivad sattuda sisemistest elektrinähtustest tingitud soojuslike toimete alla ja mille riknemine võib vähendada kooste ohutust, ei tohi anomaalse kuumuse ega tule toimel kahjustuda ning neid tuleb kontrollida jaotises 10.2.3.2 kirjeldatud hõõgtraatkatsetusega.

source: For the purpose of this test, a protective conductor (PE) is not considered as a current-carrying part.
et: Kaitsejuhti (PE) sellisel katsetusel voolujuhtiva osana ei arvestata.

source: 8.1.4 Resistance to ultra-violet (UV) radiation
et: 8.1.4 Vastupidavus ultraviolettkiirgusele

source: External surfaces made of insulating material(s) and coated metal enclosures which are intended to be used outdoor exposed to ultra-violet radiation shall not crack nor deteriorate such that it impairs the safety of the assembly.
et: Välisoludes kasutatavad isoleermaterjali(de)st pinnad ja kaetud metallümbrised, mis on välisoludes kasutamiseks ette nähtud ja millele toimib ultraviolettkiirgus, ei tohi praguneda ega halveneda sellisel määral, et see mõjutaks kooste ohutust.

source: Resistance to ultra-violet radiation shall be verified according to 10.2.4.
et: Vastupidavust ultraviolettkiirgusele tuleb kontrollida vastavalt jaotisele 10.2.4.

source: NOTE
et: MÄRKUS

source: For assemblies exposed to UV radiation, other than solar radiation, the means of verification for resistance of the enclosures and external parts made of insulating material or external metal parts that are coated on their exposed surface(s) by synthetic material, are subject to agreement between the user and the manufacturer.
et: Koostete puhul, millele toimib päikesekiirgusest erinev ultraviolettkiirgus, ning isoleermaterjalist valmistatud ümbriste ja välisosade või kiirguse toime all olevate sünteetilise materjaliga kaetud metall-välisosade pindade puhul on ultraviolettkiirgusele vastupidavuse kontrolli viisid kooste tootja ja kasutaja vahelise kokkuleppe asi.

source: 8.1.5 Mechanical strength
et: 8.1.5 Mehaaniline tugevus

source: All enclosures or partitions, including locking means and hinges for doors, shall be of a mechanical strength sufficient to withstand the stresses to which they may be subjected in normal service, (see also 10.2.8) and during short-circuit conditions (see also 10.11).
et: Kõik ümbrised ja vaheseinad, sealhulgas uste lukustusseadised ja hinged, peavad olema mehaaniliselt piisavalt tugevad, et taluda neile normaaltalitlusel (vt ka jaotis 10.2.8) ja lühiseoludes toimivaid koormusi (vt ka jaotis 10.11).

source: The mechanical operation of removable parts, including any insertion interlock, shall be verified by test according to 10.2.8.
et: Eemaldatavate osade, sealhulgas mistahes sisestusblokeeringu mehaanilist talitlust tuleb kontrollida vastavalt jaotises 10.2.8 kirjeldatud katsetusele.

source: 8.1.6 Lifting provision
et: 8.1.6 Tõstekorraldus

source: Where lifting, other than by manual means is recommended by the manufacturer, e.g. by crane or fork lift truck, transport units shall be provided with the appropriate provision for lifting.
et: Kui tootja on soovitanud kasutada tõstmist mitte-käsivahenditega, vaid nt kraana või kahveltõstuki abil, tuleb transportühikud varustada asjakohaste tõstekorraldusvahenditega.

source: Compliance is verified according to 10.2.5.
et: Nõuetele vastavust kontrollitakse jaotises 10.2.5 kirjeldatud katsetusega.

source: 8.2 Degree of protection provided by an assembly enclosure
et: 8.2 Kooste ümbrisega tagatav kaitseaste

source: 8.2.1 Protection against mechanical impact (IK code)
et: 8.2.1 Kaitse mehaaniliste toimete eest (IK-kood)

source: The minimum degree of protection provided by an assembly enclosure against mechanical impact, if necessary, shall be defined by the relevant assembly standards.
et: Kooste ümbrisega tagatav vähim kaitseaste mehaaniliste toimete eest tuleb vajaduse korral määratleda asjakohastes koostestandardites.

source: Compliance is verified according to 10.2.6.
et: Vastavust tuleb kontrollida jaotise 10.2.6 järgi.

source: 8.2.2 Protection against contact with live parts, ingress of solid foreign bodies and water (IP code)
et: 8.2.2 Kaitse pingestatud osadega kokkupuute ning tahkete võõrkehade ja vee sissepääsu eest (IP-kood)

source: The degree of protection provided by any assembly against contact with live parts, ingress of solid foreign bodies and water is indicated by the IP code according to IEC 60529:1989, IEC 60529:1989/AMD1:1999 and IEC 60529:1989/AMD2:2013; and verified according to 10.3.
et: Mingi kooste kaitseastet pingestatud osadega kokkupuute ning tahkete võõrkehade ja vee sissepääsu eest tähistatakse vastavalt standardile IEC 60529:1989 ja selle muudatustele IEC 60529:1989/AMD1:1999 ja IEC 60529:1989/AMD2:2013 IP-koodiga ning kontrollitakse vastavalt jaotisele 10.3.

source: After installation in accordance with the assembly manufacturer's instructions, the degree of protection of an enclosed assembly shall be at least IP2X.
et: Kinnise kooste kaitseaste peab pärast kooste paigaldamist vastavalt kooste tootja juhistele olema vähemalt IP2X.

source: The degree of protection provided from the front of a dead-front assembly shall be at least IPXXB.
et: Eest kinnise kooste kaitseaste peab eestpoolt olema vähemalt IPXXB.

source: For assemblies for outdoor use having no supplementary protection, the second characteristic numeral shall be at least 3.
et: Väljas kasutatava lisakaitseta koostete kaitseastme teine tunnusnumber peab olema vähemalt 3.

source: For outdoor installation, supplementary protection can be protective roofing or similar.
et: Välispaigaldise korral võib lisakaitseks olla kaitsekatus või muu taoline.

source: Unless otherwise specified, the degree of protection indicated by the assembly manufacturer applies to the complete assembly when installed in accordance with the assembly manufacturer's instructions, for example sealing of the open mounting surface of an assembly, etc.
et: Kui pole sätestatud teisiti, rakendatakse kooste tootja näidatud kaitseastet kogu kooste kohta, kui see on paigaldatud vastavalt kooste tootja juhistele, näiteks kooste lahtise kinnituspinna tihendamine jne.

source: Where the assembly does not have the same IP rating throughout, the assembly manufacturer shall declare the IP rating for the separate parts.
et: Kui kooste osade kaitseastmed ei ole ühesugused, peab kooste tootja deklareerima eri osade kaitseastmed eraldi.

source: Different IP ratings shall not impair the intended use of the assembly.
et: Kaitseastmete erisugused tunnusväärtused ei tohi kahjustada kooste ettenähtud kasutamist.

source: EXAMPLES:
et: NÄITED

source: • operating face IP20, other parts IP00;
et: • Teeninduskülg IP20, muud osad IP00.

source: • drain holes in the base IPXXD, other parts IP43.
et: • Aluses olevad veeväljapääsuavad IPXXD, muud osad IP43.

source: IP codes shall not be declared by the assembly manufacturer unless the appropriate verifications have been made according to 10.3.
et: Kooste tootja ei tohi deklareerida IP-koode, väljaarvatult juhul, mil asjakohased kontrollitoimingud on sooritatud vastavalt jaotisele 10.3.

source: Enclosed assemblies, for outdoor and indoor installation, intended for use in locations with high humidity and temperatures varying within wide limits, shall be provided with suitable arrangements (ventilation and/or internal heating, drain holes, etc.) to prevent harmful condensation within the assembly.
et: Välis- ja sisepaigaldiste kinnistes koostetes, mis on ette nähtud kasutamiseks väga niisketes ja suure temperatuurikõikumisega kohtades, tuleb vee koostesisese kahjuliku kondenseerumise vältimiseks rakendada sobivaid korraldusviise (ventilatsioon ja/või siseküte, veeväljapääsuavad jne).

source: However, the specified degree of protection shall at the same time be maintained.
et: Ühtlasi tuleb aga säilitada sätestatud kaitseaste.

source: 8.2.3 Assembly with removable parts
et: 8.2.3 Eemaldatavate osadega kooste

source: The degree of protection (IP) indicated for assemblies normally applies to the connected position (see 3.2.3) of the removable parts.
et: Koostetele määratud kaitseaste (IP) kehtib tavaliselt eemaldatavate osade ühendatud asendi korral (vt termin 3.2.3).

source: If, after the removal of a removable part, it is not possible to maintain the original degree of protection (e.g. by closing a door), the assembly manufacturer shall make available covers or similar to restore the original degree of protection.
et: Kui pärast eemaldatava osa eemaldamist ei ole võimalik säilitada kooste originaalkaitseastet (nt ukse sulgemise teel), peab kooste tootja tegema kättesaadavaks katted või muud taolised, et taastada originaalkaitseaste.

source: If these measures are not available, the IP tests shall be carried out without the removable part in place.
et: Kui need meetmed ei ole kättesaadavad, tuleb IP-katsetused sooritada eemaldatavate osade oma paigal olekuta.

source: When shutters are used to provide adequate protection to live parts, they shall be secured to prevent unintentional removal.
et: Kui pingestatud osade adekvaatse puutekaitse tagamiseks kasutatakse luuke, peavad need olema turvaliselt kaitstud tahtmatu eemaldamise eest.

source: 8.3 Clearances and creepage distances
et: 8.3 Õhk- ja roomevahemikud

source: 8.3.1 General
et: 8.3.1 Üldnõuded

source: The requirements for clearances and creepage distances are based on the principles of IEC 60664-1:2007 and are intended to provide insulation coordination within the installation.
et: Õhk- ja roomevahemikele esitatavad nõuded põhinevad standardi IEC 60664-1:2007 põhimõtetel ning on ette nähtud selleks, et tagada isolatsiooni paigaldisesisene koordinatsioon.

source: Further information is available in IEC TR 60664-2-1:2011.
et: Lähem teave on kättesaadav dokumendist IEC TR 60664-2-1:2011.

source: The clearances and creepage distances of equipment that form part of the assembly shall comply with the requirements of the relevant product standard.
et: Kooste osaks olevate seadmete õhk- ja roomevahemikud peavad vastama asjakohaste tootestandardite nõuetele.

source: When incorporating equipment into the assembly, the specified clearances and creepage distances shall be maintained during normal service conditions.
et: Seadmete paigutamisel koostesse peavad sätestatud õhk- ja roomevahemikud normaaltalitlusoludes säilima.

source: For dimensioning clearances and creepage distances between separate circuits, the highest voltage ratings shall be used (rated impulse withstand voltage for clearances and rated insulation voltage for creepage distances).
et: Eraldatud ahelate vaheliste õhk- ja roomevahemike valikul tuleb lähtuda pinge suurimatest tunnusandmetest (õhkvahemikel tunnus-impulsstaluvuspingest, roomevahemikel isolatsiooni tunnuspingest).

source: The clearances and creepage distances apply to line to line, line to neutral, and, except where a conductor is connected directly to earth, line to earth and neutral to earth.
et: Õhk- ja roomevahemikud kehtivad vahemikele kahe faasijuhi ning faasi- ja neutraaljuhi vahel või, kui juht ei ole ühendatud otseselt maaga, vahemikele faasijuhi ja maa ning neutraaljuhi ja maa vahel.

source: For bare live conductors and terminations, the clearances and creepage distances shall at least be equivalent to those specified for the equipment with which they are directly associated.
et: Pingestatud paljasjuhtide ja lõpuühenduste õhk- ja roomevahemikud peavad olema vähemalt võrdväärsed nendega otseselt ühendatud seadmete jaoks sätestatud nõuetega.

source: The effect of a short-circuit up to and including the declared rating(s) of the assembly shall not reduce permanently the clearances or creepage distances between busbars and/or connections below the values specified for the assembly.
et: Lühise toime kuni kooste deklareeritud tunnusandmeteni ei tohi püsivalt vähendada lattide- ja/või ühendustevahelisi õhk- ja roomevahemikke alla koostele sätestatud väärtuste.

source: Deformation of parts of the enclosure or of the internal partitions, barriers and obstacles due to a short-circuit shall not reduce permanently the clearances or creepage distances below those specified in 8.3.2 and 8.3.3 (see also 10.11.5.5).
et: Ümbrise osade või sisemiste vaheseinte, kaitsepiirete ja kaitsetõkete lühisest tingitud deformatsioon ei tohi püsivalt vähendada õhk- ega roomevahemikke alla jaotistes 8.3.2 ja 8.3.3 sätestatud väärtuste (vt ka 10.11.5.5).

source: 8.3.2 Clearances
et: 8.3.2 Õhkvahemikud

source: The clearances shall be sufficient to enable the declared rated impulse withstand voltage (Uimp) of a circuit to be achieved.
et: Õhkvahemikud peavad olema piisavad, et tagada ahela deklareeritud tunnus-impulsstaluvuspinge (Uimp).

source: The clearances shall be at least as specified in Table 1; if not, a design verification test and a routine impulse withstand voltage test are carried out in accordance with 10.9.3 and 11.3, respectively.
et: Õhkvahemikud peavad olema vähemalt sama laiad, nagu sätestatud tabelis 1; kui mitte, tuleb sooritada konstruktsiooni kontrollkatsetus ja impulsstaluvuspinge tavakatsetus vastavalt jaotistele 10.9.3 ja 11.3.

source: The method of determining clearances by measurement is given in Annex F.
et: Õhkvahemike määramise meetod mõõtmise teel on esitatud lisas F.

source: 8.3.3 Creepage distances The original manufacturer shall select a rated insulation voltage(s) (Ui) for the circuits of the assembly from which the creepage distance(s) shall be determined.
et: 8.3.3 Roomevahemikud Esmatootja peab kooste ahelate jaoks valima isolatsiooni tunnuspinge(d) (Ui), mille põhjal tuleb määrata roomevahemik(ud).

source: For any given circuit, the rated insulation voltage shall not be less than the rated operational voltage (Ue).
et: Ühegi antud ahela isolatsiooni tunnuspinge ei tohi olla väiksem kui tunnustalitluspinge (Ue).

source: The creepage distances shall not, in any case, be less than the associated minimum clearances.
et: Roomevahemikud ei tohi mingil juhul olla väiksemad kui nendega seotud vähimad õhkvahemikud.

source: Creepage distances shall correspond to a pollution degree as specified in 7.1.2 and to the corresponding material group at the rated insulation voltage given in Table 2.
et: Roomevahemikud peavad vastama jaotises 7.1.2 määratletud saasteastmele ja tabelis 2 esitatud isolatsiooni tunnuspinge järgi määratletud materjalirühmale.

source: The method of determining creepage distances by measurement is given in Annex F.
et: Roomevahemike määramise meetod mõõtmise teel on esitatud lisas F.

source: For inorganic insulating materials, e.g. glass or ceramics, which do not track, creepage distances need not be greater than their associated clearances.
et: Anorgaaniliste isolatsioonimaterjalide, nt klaasi või keraamika puhul, millel roomet ei teki, ei pea roomevahemikud olema suuremad kui nendega seotud õhkvahemikud.

source: However, the risk of disruptive discharge should be considered.
et: Tuleb aga siiski arvestada läbilöögiriski.

source: By using ribs of a minimum height of 2 mm, the creepage distance may be reduced but, irrespective of the number of ribs, shall be not less than 0,8 times the value of Table 2 and not less than the associated minimum clearance.
et: Kui kasutada ribisid kõrgusega vähemalt 2 mm, võib roomevahemikku vähendada, kuid sõltumata ribide arvust peab see olema vähemalt 0,8-kordne tabelis 2 esitatud väärtusest ja mitte väiksem kui sellega seotud vähim õhkvahemik.

source: The minimum base of the rib is determined by mechanical requirements (see Clause F.2).
et: Ribi aluse vähimalt vajalik laius on määratud mehaanilise tugevuse nõuetega (vt jaotis F.2).

source: 8.4 Protection against electric shock
et: 8.4 Kaitse elektrilöögi eest

source: 8.4.1 General
et: 8.4.1 Üldnõuded
